---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceNormal
source: html/99625313-45eb-6134-937e-3f0f2906dfe3.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent.SurfaceNormal Property

The property labeled "Image" from the "AdvancedTransparent" schema.

## Syntax (C#)
```csharp
public static string SurfaceNormal { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.